In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
#series
#series s capital coz it is case sensitive

srr = pd.Series([1,2,3,'hello',[100,200,300]])
srr

0                  1
1                  2
2                  3
3              hello
4    [100, 200, 300]
dtype: object

In [5]:
srr.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
srr.values

array([1, 2, 3, 'hello', list([100, 200, 300])], dtype=object)

In [7]:
srr2 = pd.Series([1,2,3,'hello', list([100,200,300])], dtype = object)

In [8]:
srr2

0                  1
1                  2
2                  3
3              hello
4    [100, 200, 300]
dtype: object

In [11]:
import numpy as np

newsrr = pd.Series(np.random.randint(1,11,5) , index = ['one','two','three','four','five'])

In [12]:
newsrr

one      3
two      3
three    2
four     4
five     5
dtype: int32

In [13]:
newsrr.index= [i for i in range(1,6)]
newsrr

1    3
2    3
3    2
4    4
5    5
dtype: int32

In [14]:
pd.Series({
    'one' : [1,2,3,4,4],
    'two' : [10,20,30,40],
    'three' : [100,200,300,400]
})

one           [1, 2, 3, 4, 4]
two          [10, 20, 30, 40]
three    [100, 200, 300, 400]
dtype: object

In [15]:
srr

0                  1
1                  2
2                  3
3              hello
4    [100, 200, 300]
dtype: object

In [16]:
srr.dtype              #srr has diff data types values so o

dtype('O')

In [17]:
newsrr.dtype           #newsrr has same dtype values so int

dtype('int32')

In [18]:
newsrr.shape

(5,)

In [19]:
newsrr.size

5

In [20]:
srr = pd.Series(np.random.randint(1,100,20))
srr

0     56
1     67
2     91
3     71
4     98
5      6
6     77
7     38
8     11
9      2
10    76
11    23
12    98
13    17
14    96
15    99
16    73
17    79
18    87
19    24
dtype: int32

In [21]:
srr.size

20

In [22]:
srr.head()

0    56
1    67
2    91
3    71
4    98
dtype: int32

In [23]:
srr.head(3)

0    56
1    67
2    91
dtype: int32

In [24]:
srr.tail()

15    99
16    73
17    79
18    87
19    24
dtype: int32

In [25]:
srr.tail(2)

18    87
19    24
dtype: int32

In [26]:
type(srr)

pandas.core.series.Series

In [27]:
srr.info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: None
Non-Null Count  Dtype
--------------  -----
20 non-null     int32
dtypes: int32(1)
memory usage: 212.0 bytes

In [28]:
srr.name = 'hello series'

In [29]:
srr.info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: hello series
Non-Null Count  Dtype
--------------  -----
20 non-null     int32
dtypes: int32(1)
memory usage: 212.0 bytes

In [30]:
srr.mean()

59.45

In [31]:
srr.median()

72.0

In [32]:
srr.mode()

0    98
Name: hello series, dtype: int32

In [33]:
srr.value_counts()       #it will count the no of values

hello series
98    2
56    1
76    1
87    1
79    1
73    1
99    1
96    1
17    1
23    1
2     1
67    1
11    1
38    1
77    1
6     1
71    1
91    1
24    1
Name: count, dtype: int64

In [34]:
srr.mode()

0    98
Name: hello series, dtype: int32

In [35]:
srr.std()

34.281305324284865

In [36]:
srr.describe()         #statistical summary

count    20.000000
mean     59.450000
std      34.281305
min       2.000000
25%      23.750000
50%      72.000000
75%      88.000000
max      99.000000
Name: hello series, dtype: float64

In [37]:
srr.count()            #not null values

20

In [38]:
nulll = pd.Series([1,2,np.nan , pd.NA , None , 100])
nulll

0       1
1       2
2     NaN
3    <NA>
4    None
5     100
dtype: object

In [39]:
nulll.count()

3

In [40]:
nulll.size                #count the size no of values 6 values

6

In [42]:
srr[3:10] = 'hii'

0      56
1      67
2      91
3     hii
4     hii
5     hii
6     hii
7     hii
8     hii
9     hii
10     76
11     23
12     98
13     17
14     96
15     99
16     73
17     79
18     87
19     24
Name: hello series, dtype: object

In [43]:
srr

0      56
1      67
2      91
3     hii
4     hii
5     hii
6     hii
7     hii
8     hii
9     hii
10     76
11     23
12     98
13     17
14     96
15     99
16     73
17     79
18     87
19     24
Name: hello series, dtype: object

In [44]:
srr = pd.Series(np.random.rand(10))

In [45]:
srr

0    0.438814
1    0.505116
2    0.939136
3    0.995360
4    0.567862
5    0.766416
6    0.728941
7    0.940253
8    0.216537
9    0.106937
dtype: float64

In [46]:
srr = srr+10

In [47]:
srr

0    10.438814
1    10.505116
2    10.939136
3    10.995360
4    10.567862
5    10.766416
6    10.728941
7    10.940253
8    10.216537
9    10.106937
dtype: float64

In [48]:
srr = srr-10

In [49]:
srr

0    0.438814
1    0.505116
2    0.939136
3    0.995360
4    0.567862
5    0.766416
6    0.728941
7    0.940253
8    0.216537
9    0.106937
dtype: float64

In [50]:
srr **2

0    0.192558
1    0.255142
2    0.881977
3    0.990741
4    0.322467
5    0.587393
6    0.531355
7    0.884076
8    0.046888
9    0.011436
dtype: float64

In [51]:
srr[9] = srr[9] ** 100

In [52]:
srr

0    4.388138e-01
1    5.051162e-01
2    9.391362e-01
3    9.953598e-01
4    5.678618e-01
5    7.664155e-01
6    7.289409e-01
7    9.402530e-01
8    2.165367e-01
9    8.181023e-98
dtype: float64

In [53]:
srr = pd.Series(np.random.randint(1,10,10))
srr

0    6
1    4
2    8
3    2
4    9
5    1
6    1
7    6
8    7
9    9
dtype: int32

In [54]:
srr>5

0     True
1    False
2     True
3    False
4     True
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [55]:
srr[srr>5]

0    6
2    8
4    9
7    6
8    7
9    9
dtype: int32

In [56]:
srr[srr>5].count()

6

In [57]:
srr[srr>5].size

6

In [58]:
srr[(srr>5) & (srr<9)]

0    6
2    8
7    6
8    7
dtype: int32

In [59]:
srr[0] = srr[0] ** 2

In [60]:
srr

0    36
1     4
2     8
3     2
4     9
5     1
6     1
7     6
8     7
9     9
dtype: int32

In [61]:
srr.to_csv('hello.csv')

In [62]:
srr.to_excel('random.xlsx')

In [66]:
#data frames

df = pd.read_csv('customers-100.csv')
df

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [67]:
#creating our own data frame
#give the same no of values in each key value pair

data = {
    'empid' : [101,102,103,104, None],
    'empname' : ['rahul','sanika',np.nan , 'anam','aabha'],
    'salary' : [123,None,4223432,4234,pd.NA]
}

In [68]:
data

{'empid': [101, 102, 103, 104, None],
 'empname': ['rahul', 'sanika', nan, 'anam', 'aabha'],
 'salary': [123, None, 4223432, 4234, <NA>]}

In [70]:
dff = pd.DataFrame(data , index = ['one','two','three','four','five'])

In [71]:
dff

       empid empname   salary
one    101.0   rahul      123
two    102.0  sanika     None
three  103.0     NaN  4223432
four   104.0    anam     4234
five     NaN   aabha     <NA>

In [72]:
dff.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [73]:
dff.columns

Index(['empid', 'empname', 'salary'], dtype='object')

In [74]:
import seaborn as sns
data = sns.load_dataset('iris')
data

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [75]:
data.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [76]:
data.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [77]:
data.shape             #rows,cols

(150, 5)

In [78]:
data.size

750

In [79]:
150*5

750

In [80]:
data.ndim       #rows and cols so 2 dim

2

In [81]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [82]:
data.describe(include = 'all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [83]:
data.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [84]:
# column selection

data['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [85]:
#selecting multiple cols
data[['species' , 'petal_length']].head()

  species  petal_length
0  setosa           1.4
1  setosa           1.4
2  setosa           1.3
3  setosa           1.5
4  setosa           1.4

In [86]:
data.name = 'hello'

In [87]:
data.name

'hello'

In [88]:
data.count()

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [89]:
data.species.count()

150

In [90]:
data['species'].count()

150

In [93]:
data.sample(10).sort_index(ascending = False)                    #false means desc it says that randomly select 10 samples and sort it in desc

     sepal_length  sepal_width  petal_length  petal_width     species
148           6.2          3.4           5.4          2.3   virginica
146           6.3          2.5           5.0          1.9   virginica
101           5.8          2.7           5.1          1.9   virginica
96            5.7          2.9           4.2          1.3  versicolor
87            6.3          2.3           4.4          1.3  versicolor
78            6.0          2.9           4.5          1.5  versicolor
50            7.0          3.2           4.7          1.4  versicolor
40            5.0          3.5           1.3          0.3      setosa
27            5.2          3.5           1.5          0.2      setosa
25            5.0          3.0           1.6          0.2      setosa

In [94]:
data.sample(10, ignore_index = True)    #it takes randomly 10 samples by giving index linewise and ignoring their org indexes

   sepal_length  sepal_width  petal_length  petal_width     species
0           4.8          3.0           1.4          0.3      setosa
1           6.7          3.0           5.0          1.7  versicolor
2           5.7          2.6           3.5          1.0  versicolor
3           6.5          3.0           5.8          2.2   virginica
4           6.1          2.8           4.7          1.2  versicolor
5           6.7          3.1           4.7          1.5  versicolor
6           5.8          4.0           1.2          0.2      setosa
7           6.0          2.2           4.0          1.0  versicolor
8           4.6          3.6           1.0          0.2      setosa
9           5.8          2.7           4.1          1.0  versicolor

In [96]:
data.sample(10).reset_index(drop = False)  #reset is used to reset the index to the default(0,1,2,...) drop true means dont keep old index as a col 
                                           #false means keeps old index in a new col

   index  sepal_length  sepal_width  petal_length  petal_width     species
0    122           7.7          2.8           6.7          2.0   virginica
1     93           5.0          2.3           3.3          1.0  versicolor
2     54           6.5          2.8           4.6          1.5  versicolor
3     25           5.0          3.0           1.6          0.2      setosa
4     29           4.7          3.2           1.6          0.2      setosa
5      5           5.4          3.9           1.7          0.4      setosa
6     30           4.8          3.1           1.6          0.2      setosa
7    126           6.2          2.8           4.8          1.8   virginica
8      6           4.6          3.4           1.4          0.3      setosa
9     32           5.2          4.1           1.5          0.1      setosa

In [97]:
data.sample(10).reset_index(drop = True)

   sepal_length  sepal_width  petal_length  petal_width     species
0           6.9          3.1           5.1          2.3   virginica
1           6.1          2.8           4.0          1.3  versicolor
2           6.3          2.8           5.1          1.5   virginica
3           5.0          3.3           1.4          0.2      setosa
4           6.2          3.4           5.4          2.3   virginica
5           4.9          3.6           1.4          0.1      setosa
6           5.0          3.4           1.5          0.2      setosa
7           6.0          3.0           4.8          1.8   virginica
8           6.7          3.0           5.2          2.3   virginica
9           6.1          2.6           5.6          1.4   virginica

In [98]:
data.sepal_length = data['sepal_length'] + 10

In [99]:
data

     sepal_length  sepal_width  petal_length  petal_width    species
0            15.1          3.5           1.4          0.2     setosa
1            14.9          3.0           1.4          0.2     setosa
2            14.7          3.2           1.3          0.2     setosa
3            14.6          3.1           1.5          0.2     setosa
4            15.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145          16.7          3.0           5.2          2.3  virginica
146          16.3          2.5           5.0          1.9  virginica
147          16.5          3.0           5.2          2.0  virginica
148          16.2          3.4           5.4          2.3  virginica
149          15.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [100]:
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [101]:
df[(df.total_bill > 20) & (df.tip > 5) & (df.sex == 'Female')][['total_bill' , 'tip' , 'day']]

     total_bill   tip   day
52        34.81  5.20   Sun
85        34.83  5.17  Thur
155       29.85  5.14   Sun
214       28.17  6.50   Sat

In [102]:
df.day.value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [103]:
df.isna().sum()   #isna gives true false if value is missing so to get count of missing values give sum

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [104]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [105]:
dff = pd.DataFrame(data)

In [106]:
dff

     sepal_length  sepal_width  petal_length  petal_width    species
0            15.1          3.5           1.4          0.2     setosa
1            14.9          3.0           1.4          0.2     setosa
2            14.7          3.2           1.3          0.2     setosa
3            14.6          3.1           1.5          0.2     setosa
4            15.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145          16.7          3.0           5.2          2.3  virginica
146          16.3          2.5           5.0          1.9  virginica
147          16.5          3.0           5.2          2.0  virginica
148          16.2          3.4           5.4          2.3  virginica
149          15.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [107]:
data = {
    'empid' : [101,102,103,104, None],
    'empname' : ['rahul','sanika',np.nan , 'anam','aabha'],
    'salary' : [123,None,4223432,4234,pd.NA]
}
data

{'empid': [101, 102, 103, 104, None],
 'empname': ['rahul', 'sanika', nan, 'anam', 'aabha'],
 'salary': [123, None, 4223432, 4234, <NA>]}

In [108]:
dff = pd.DataFrame(data)
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika     None
2  103.0     NaN  4223432
3  104.0    anam     4234
4    NaN   aabha     <NA>

In [109]:
dff.fillna(0 , inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7892\4086921458.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  dff.fillna(0 , inplace=True)

In [110]:
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika        0
2  103.0       0  4223432
3  104.0    anam     4234
4    0.0   aabha        0

In [111]:
dff.fillna('hello')

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika        0
2  103.0       0  4223432
3  104.0    anam     4234
4    0.0   aabha        0

In [112]:
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika        0
2  103.0       0  4223432
3  104.0    anam     4234
4    0.0   aabha        0

In [113]:
dff = pd.DataFrame(data)
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika     None
2  103.0     NaN  4223432
3  104.0    anam     4234
4    NaN   aabha     <NA>

In [114]:
dff.empid.fillna(dff.empid.mean() , inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7892\3047203057.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dff.empid.fillna(dff.empid.mean() , inplace=True)

In [115]:
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika     None
2  103.0     NaN  4223432
3  104.0    anam     4234
4  102.5   aabha     <NA>

In [116]:
dff.salary.mode()

0        123
1       4234
2    4223432
Name: salary, dtype: object

In [117]:
dff.salary.fillna(123 , inplace=True)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7892\2624595631.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dff.salary.fillna(123 , inplace=True)
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7892\2624595631.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  dff.salary.fillna(123 , inplace=True)

In [118]:
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika      123
2  103.0     NaN  4223432
3  104.0    anam     4234
4  102.5   aabha      123

In [119]:
dff.salary.mode()

0    123
Name: salary, dtype: int64

In [120]:
dff

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika      123
2  103.0     NaN  4223432
3  104.0    anam     4234
4  102.5   aabha      123

In [121]:
dff.bfill()       #backward fill   niche vale upar

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika      123
2  103.0    anam  4223432
3  104.0    anam     4234
4  102.5   aabha      123

In [122]:
dff.ffill()     #forward fill    upar ke niche

   empid empname   salary
0  101.0   rahul      123
1  102.0  sanika      123
2  103.0  sanika  4223432
3  104.0    anam     4234
4  102.5   aabha      123

In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({
    'Name' : ['rahul','shivam','marya'],
    'age' : [23,22,21],
    'salary' : [25000,40000,10000]
    })
df2 = pd.DataFrame({
    'Name': ['jai','veeru'],
    'age' : [22,23],
    'salary' : [50000,25000]
})

df1

In [5]:
df1

     Name  age  salary
0   rahul   23   25000
1  shivam   22   40000
2   marya   21   10000

In [6]:
df2

    Name  age  salary
0    jai   22   50000
1  veeru   23   25000

In [7]:
out = pd.concat([df1,df2])

In [8]:
out

     Name  age  salary
0   rahul   23   25000
1  shivam   22   40000
2   marya   21   10000
0     jai   22   50000
1   veeru   23   25000

In [9]:
out = pd.concat([df1,df2] , ignore_index = True)

In [10]:
out

     Name  age  salary
0   rahul   23   25000
1  shivam   22   40000
2   marya   21   10000
3     jai   22   50000
4   veeru   23   25000

In [11]:
df3 = pd.DataFrame({
    'degree' : ['a','b','c','d','e']
})

In [12]:
df3

  degree
0      a
1      b
2      c
3      d
4      e

In [14]:
pd.concat([out,df3])

     Name   age   salary degree
0   rahul  23.0  25000.0    NaN
1  shivam  22.0  40000.0    NaN
2   marya  21.0  10000.0    NaN
3     jai  22.0  50000.0    NaN
4   veeru  23.0  25000.0    NaN
0     NaN   NaN      NaN      a
1     NaN   NaN      NaN      b
2     NaN   NaN      NaN      c
3     NaN   NaN      NaN      d
4     NaN   NaN      NaN      e

In [15]:
pd.concat([out,df3] , axis = 1)  #by default axis is 0 it means it adds in the next by next rows to add in the col use axis=1

     Name  age  salary degree
0   rahul   23   25000      a
1  shivam   22   40000      b
2   marya   21   10000      c
3     jai   22   50000      d
4   veeru   23   25000      e

In [16]:
df1

     Name  age  salary
0   rahul   23   25000
1  shivam   22   40000
2   marya   21   10000

In [17]:
df2

    Name  age  salary
0    jai   22   50000
1  veeru   23   25000

In [18]:
pd.merge(df1 , out, how = 'inner' , on = 'Name')  #left right outer inner  = these are joins how values, in sql join here merge

     Name  age_x  salary_x  age_y  salary_y
0   rahul     23     25000     23     25000
1  shivam     22     40000     22     40000
2   marya     21     10000     21     10000

In [19]:
import seaborn as sns
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [20]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
df.total_bill[1:10]    #slicing

1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
6     8.77
7    26.88
8    15.04
9    14.78
Name: total_bill, dtype: float64

In [22]:
#loc

df.loc[1:10:2,['smoker','day']]

  smoker  day
1     No  Sun
3     No  Sun
5     No  Sun
7     No  Sun
9     No  Sun

In [23]:
df.iloc[1:10 , 1]   #1 is order no of col which starts from zero

1    1.66
2    3.50
3    3.31
4    3.61
5    4.71
6    2.00
7    3.12
8    1.96
9    3.23
Name: tip, dtype: float64

In [24]:
df.iloc[1:10 , [0,1]]

   total_bill   tip
1       10.34  1.66
2       21.01  3.50
3       23.68  3.31
4       24.59  3.61
5       25.29  4.71
6        8.77  2.00
7       26.88  3.12
8       15.04  1.96
9       14.78  3.23

In [25]:
#apply func

out

     Name  age  salary
0   rahul   23   25000
1  shivam   22   40000
2   marya   21   10000
3     jai   22   50000
4   veeru   23   25000